Feature: Оценка на песен

  Background:
    Given Потребителя ортваря детайлите на "книга1"

  Scenario: Успешна оценка на книга
    When избере 5 звезди
    And напише коментар "Стахотна книга"
    And натисне на бутона за оценка
    Then вижда съобшение "Оценихте книга1 с 5 звезди"

  Scenario: Успешна оценка на книга без коментар
    When избере 5 звезди
    And натисне на бутона за оценка
    Then вижда съобшение "Оценихте книга1 с 5 звезди"

  Scenario: Оценка на книга с коментар над 100 синвола
    When избере 2 звезди
    And напише коментар "Книгата изобщо не ми хареса! Автора ме разочрова... 927035815619852659826986389903047847305917"
    And натисне на бутона за оценка
    Then вижда съобшение "Коментара трябва да е под 100 синвола!"

  Scenario: Оценка на книга с коментар със забранени синволи
    When избере 3 звезди
    And напише коментар "Не сам впечтлена. №$%§§*@<>:;"
    And натисне на бутона за оценка
    Then вижда съобшение "Използвате забранени синволи"

  Scenario: Оценка на книга без избор на звезди
    When напише коментар "Невероватна е!"
    And натисне на бутона за оценка
    Then вижда съобшение "Не сте избрали звезди"

  Scenario Outline:
    When избере <брой> звезди
    And напише коментар <коментар>
    And натисне на бутона за оценка
    Then вижда съобшение <очаквано съобщение>
    Examples:
      | брой | коментар                                              | очаквано съобщение                      |
      | 2    | "Бива"                                                | "Оценихте книга1 с 5 звезди"            |
      | 2    | "Бива12345678901234567890123456789012345678901234567" | "Коментара трябва да е под 100 синвола!" |
      | 2    | "Бива №$%§§*@<>:;"                                    | "Използвате забранени синволи"          |
      | 2    | ""                                                    | "Оценихте книга2 с 2 звезди"            |
      | 16   | ""                                                    | "Звездите трябва да са между 1 и 5"                      |
      | -1   | ""                                                    | "Звездите трябва да са между 1 и 5"                      |
